docker_exp/docker_test/vm/stress_10000_1.txt
This is ApacheBench, Version 2.3 <$Revision: 1528965 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.0.244 (be patient)


Server Software:        Apache/2.4.17
Server Hostname:        192.168.0.244
Server Port:            80

Document Path:          /OS_ORDER_1.txt
Document Length:        1024 bytes

Concurrency Level:      100
Time taken for tests:   1.385 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      12720000 bytes
HTML transferred:       10240000 bytes
Requests per second:    7219.52 [#/sec] (mean)
Time per request:       13.851 [ms] (mean)
Time per request:       0.139 [ms] (mean, across all concurrent requests)
Transfer rate:          8968.00 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    2   0.5      3       3
Processing:     1   11   4.9     11      58
Waiting:        1   11   4.9     11      58
Total:          2   14   4.9     13      60
ERROR: The median and mean for the initial connection time are more than twice the standard
       deviation apart. These results are NOT reliable.

Percentage of the requests served within a certain time (ms)
  50%     13
  66%     13
  75%     13
  80%     13
  90%     13
  95%     14
  98%     14
  99%     49
 100%     60 (longest request)