docker_exp/docker_test/vm/stress_10000_128byte.txt
This is ApacheBench, Version 2.3 <$Revision: 1528965 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.0.244 (be patient)


Server Software:        Apache/2.4.17
Server Hostname:        192.168.0.244
Server Port:            80

Document Path:          /OS_ORDER_128byte.txt
Document Length:        218 bytes

Concurrency Level:      100
Time taken for tests:   1.169 seconds
Complete requests:      10000
Failed requests:        0
Non-2xx responses:      10000
Total transferred:      3960000 bytes
HTML transferred:       2180000 bytes
Requests per second:    8552.86 [#/sec] (mean)
Time per request:       11.692 [ms] (mean)
Time per request:       0.117 [ms] (mean, across all concurrent requests)
Transfer rate:          3307.55 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       2
Processing:     1   11   4.0     11      51
Waiting:        1   11   4.0     11      51
Total:          2   12   4.0     11      51

Percentage of the requests served within a certain time (ms)
  50%     11
  66%     11
  75%     11
  80%     11
  90%     11
  95%     12
  98%     26
  99%     39
 100%     51 (longest request)