docker_exp/docker_test/vm/stress_10000_512byte.txt
This is ApacheBench, Version 2.3 <$Revision: 1528965 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.0.244 (be patient)


Server Software:        Apache/2.4.17
Server Hostname:        192.168.0.244
Server Port:            80

Document Path:          /OS_ORDER_512byte.txt
Document Length:        218 bytes

Concurrency Level:      100
Time taken for tests:   1.183 seconds
Complete requests:      10000
Failed requests:        0
Non-2xx responses:      10000
Total transferred:      3960000 bytes
HTML transferred:       2180000 bytes
Requests per second:    8456.37 [#/sec] (mean)
Time per request:       11.825 [ms] (mean)
Time per request:       0.118 [ms] (mean, across all concurrent requests)
Transfer rate:          3270.24 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.2      0       2
Processing:     1   12   3.8     11      47
Waiting:        1   12   3.8     11      47
Total:          2   12   3.8     11      47

Percentage of the requests served within a certain time (ms)
  50%     11
  66%     11
  75%     11
  80%     11
  90%     12
  95%     12
  98%     31
  99%     36
 100%     47 (longest request)